
## Plan Result (aat)




<pre><code>Plan: 5 to add, 2 to change, 0 to destroy.</code></pre>

* Create
  * module.ccpay-feeregister-api-core.azurerm_api_management_api.api
  * module.ccpay-feeregister-api-core.azurerm_api_management_product_api.link_to_product[0]
  * module.ccpay-feeregister-policy-core.azurerm_api_management_api_policy.api_policy
  * module.ccpay-feeregister-product-core.azurerm_api_management_product.product
  * module.ccpay-feeregister-product-core.azurerm_api_management_product_group.access_control_groups[&#34;developers&#34;]
* Update
  * azurerm_api_management_subscription.fee_pay_team_fee_register_subscription
  * azurerm_api_management_subscription.liberata_supplier_fee_register_subscription


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_api_management_subscription.fee_pay_team_fee_register_subscription will be updated in-place
  ~ resource "azurerm_api_management_subscription" "fee_pay_team_fee_register_subscription" {
      ~ allow_tracing       = false -> true
        id                  = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.ApiManagement/service/cft-api-mgmt-stg/subscriptions/7a413a4b-70fd-43ae-891f-781fb1b54508"
        # (10 unchanged attributes hidden)
    }

  # azurerm_api_management_subscription.liberata_supplier_fee_register_subscription will be updated in-place
  ~ resource "azurerm_api_management_subscription" "liberata_supplier_fee_register_subscription" {
      ~ allow_tracing       = false -> true
        id                  = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.ApiManagement/service/cft-api-mgmt-stg/subscriptions/1b28771a-f1bf-484a-b7f6-ead7cc86407f"
        # (10 unchanged attributes hidden)
    }

  # module.ccpay-feeregister-api-core.azurerm_api_management_api.api will be created
  + resource "azurerm_api_management_api" "api" {
      + api_management_name   = "core-api-mgmt-aat"
      + api_type              = "http"
      + display_name          = "Fee Register API"
      + id                    = (known after apply)
      + is_current            = (known after apply)
      + is_online             = (known after apply)
      + name                  = "feeregister-apiList"
      + path                  = "feeRegister-api"
      + protocols             = [
          + "http",
          + "https",
        ]
      + resource_group_name   = "core-infra-aat"
      + revision              = "1"
      + service_url           = "http://fees-register-api-aat.service.core-compute-aat.internal"
      + soap_pass_through     = (known after apply)
      + subscription_required = true
      + version               = (known after apply)
      + version_set_id        = (known after apply)

      + import {
          + content_format = "swagger-link-json"
          + content_value  = "https://raw.githubusercontent.com/hmcts/reform-api-docs/master/docs/specs/ccpay-payment-app.freg_api1.json"
        }
    }

  # module.ccpay-feeregister-api-core.azurerm_api_management_product_api.link_to_product[0] will be created
  + resource "azurerm_api_management_product_api" "link_to_product" {
      + api_management_name = "core-api-mgmt-aat"
      + api_name            = "feeregister-apiList"
      + id                  = (known after apply)
      + product_id          = "feeRegister"
      + resource_group_name = "core-infra-aat"
    }

  # module.ccpay-feeregister-policy-core.azurerm_api_management_api_policy.api_policy will be created
  + resource "azurerm_api_management_api_policy" "api_policy" {
      + api_management_name = "core-api-mgmt-aat"
      + api_name            = "feeregister-apiList"
      + id                  = (known after apply)
      + resource_group_name = "core-infra-aat"
      + xml_content         = <<-EOT
            <policies>
              <backend>
                <base/>
              </backend>
              <inbound>
                <base/>
                <choose>
                  <when condition="@(context.Request.Certificate == null || context.Request.Certificate.NotAfter < DateTime.Now || context.Request.Certificate.NotBefore > DateTime.Now || !(new string[] {&quot;B1BF8007527F85085D7C4A3DC406A9A6D124D721&quot;,&quot;E5F54E7BA2B780E2B1B1FFAC68F801251935BE80&quot;,&quot;B9D9E70AC23EAF8EA094F6B59EF77FF77D977CBE&quot;,&quot;D36AC5686200258AE7C03CCCA70E14B69C17F94B&quot;}.Any(c => c == context.Request.Certificate.Thumbprint)))" >
                    <return-response>
                      <set-status code="403" reason="Invalid client certificate. Please check expiry."/>
                    </return-response>
                  </when>
                </choose>
                <!-- generate totp -->
              </inbound>
              <outbound>
                <base/>
            </outbound>
              <on-error>
                <base/>
              </on-error>
            </policies>
        EOT
    }

  # module.ccpay-feeregister-product-core.azurerm_api_management_product.product will be created
  + resource "azurerm_api_management_product" "product" {
      + api_management_name   = "core-api-mgmt-aat"
      + approval_required     = true
      + display_name          = "feeRegister"
      + id                    = (known after apply)
      + product_id            = "feeRegister"
      + published             = true
      + resource_group_name   = "core-infra-aat"
      + subscription_required = true
      + subscriptions_limit   = 20
    }

  # module.ccpay-feeregister-product-core.azurerm_api_management_product_group.access_control_groups["developers"] will be created
  + resource "azurerm_api_management_product_group" "access_control_groups" {
      + api_management_name = "core-api-mgmt-aat"
      + group_name          = "developers"
      + id                  = (known after apply)
      + product_id          = "feeRegister"
      + resource_group_name = "core-infra-aat"
    }

Plan: 5 to add, 2 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":594,"Program":"tfcmt","SHA1":"","Target":"aat","Vars":{}} -->